Repository: Kuldeep2602/cold_storage_fe
Catalog: lib/l10n/app_*.arb
Languages: hi

# appTitle
source: ColdOne
hi: कोल्डवन

source: Storage Login
hi: स्टोरेज लॉगिन

source: Phone Number
hi: फ़ोन नंबर

source: Enter phone number
hi: फ़ोन नंबर दर्ज करें

source: Enter mobile number
hi: मोबाइल नंबर दर्ज करें

source: Get OTP
hi: OTP प्राप्त करें

source: Send OTP
hi: OTP भेजें

source: Enter OTP
hi: OTP दर्ज करें

source: Verify
hi: सत्यापित करें

source: Verify OTP
hi: OTP सत्यापित करें

source: Logout
hi: लॉग आउट

# continueText
source: Continue
hi: जारी रखें

# chooseLanguage
source: Choose your preferred language
hi: अपनी पसंदीदा भाषा चुनें

# changeLanguageLater
source: You can change this later in settings
hi: आप इसे बाद में सेटिंग्स में बदल सकते हैं

# languageComingSoon
source: This language is coming soon! Please select English for now.
hi: यह भाषा जल्द आ रही है! कृपया अभी अंग्रेज़ी चुनें।

source: Select role
hi: भूमिका चुनें

source: Operator
hi: ऑपरेटर

# operatorDescription
source: Handles day-to-day operations
hi: दैनिक कार्यों को संभालता है

source: Technician
hi: तकनीशियन

# technicianDescription
source: Manages technical aspects
hi: तकनीकी पहलुओं का प्रबंधन करता है

source: Manager
hi: प्रबंधक

# managerDescription
source: Oversees team and operations
hi: टीम और संचालन की देखरेख करता है

source: Owner
hi: मालिक

# ownerDescription
source: Full access and control
hi: पूर्ण पहुंच और नियंत्रण

source: Admin
hi: व्यवस्थापक

# secureLogin
source: Secure login for storage operations
hi: स्टोरेज संचालन के लिए सुरक्षित लॉगिन

# pleaseEnterPhone
source: Please enter your phone number
hi: कृपया अपना फ़ोन नंबर दर्ज करें

# pleaseEnterValidPhone
source: Please enter a valid phone number
hi: कृपया एक वैध फ़ोन नंबर दर्ज करें

# unauthorizedContact
source: Unauthorized: Please contact your administrator to register.
hi: अनधिकृत: कृपया पंजीकरण के लिए अपने व्यवस्थापक से संपर्क करें।

# enterOTPCode
source: Enter the 6-digit code sent to
hi: इस नंबर पर भेजा गया 6 अंकों का कोड दर्ज करें

source: Please enter complete OTP
hi: कृपया पूरा OTP दर्ज करें

# otpSentSuccess
source: OTP sent successfully
hi: OTP सफलतापूर्वक भेजा गया

source: Go Back?
hi: वापस जाएं?

# goBackConfirm
source: Do you want to go back and change your phone number or role?
hi: क्या आप वापस जाकर अपना फ़ोन नंबर या भूमिका बदलना चाहते हैं?

source: Change Phone
hi: फ़ोन बदलें

source: Change Role
hi: भूमिका बदलें

# resendOTPIn
source: Resend OTP in {seconds}s
hi: {seconds} सेकंड में OTP पुनः भेजें

source: Resend OTP
hi: OTP पुनः भेजें

# debugOTP
source: Debug OTP: {otp}
hi: डीबग OTP: {otp}

source: Access Pending
hi: पहुंच लंबित

# accountCreatedNoAccess
source: Your account has been created but you don't have access yet.
hi: आपका खाता बना दिया गया है लेकिन आपको अभी पहुंच नहीं है।

# contactAdminTo
source: Please contact your administrator to:
hi: कृपया अपने व्यवस्थापक से संपर्क करें:

# assignRole
source: Assign you a role (Operator/Manager)
hi: आपको एक भूमिका सौंपें (ऑपरेटर/प्रबंधक)

# activateAccount
source: Activate your account
hi: अपना खाता सक्रिय करें

source: Phone
hi: फ़ोन

# statusLabel
source: Status
hi: स्थिति

# roleLabel
source: Role
hi: भूमिका

source: Not Assigned
hi: नियुक्त नहीं

source: Logout & Try Again
hi: लॉगआउट करें और पुनः प्रयास करें

source: Dashboard
hi: डैशबोर्ड

source: Requests
hi: अनुरोध

source: Inventory
hi: इन्वेंटरी

source: Staff
hi: कर्मचारी

source: Rooms
hi: कमरे

source: Alerts
hi: अलर्ट

source: Reports
hi: रिपोर्ट

source: Temp
hi: तापमान

source: Ledger
hi: खाता बही

source: Payments
hi: भुगतान

source: Profile
hi: प्रोफ़ाइल

source: Operator Menu
hi: ऑपरेटर मेनू

source: Select operation
hi: संचालन चुनें

source: Inward Entry
hi: आवक प्रविष्टि

source: Stock loading entry
hi: स्टॉक लोडिंग प्रविष्टि

source: Outward Entry
hi: जावक प्रविष्टि

source: Stock unloading entry
hi: स्टॉक अनलोडिंग प्रविष्टि

source: Technician Menu
hi: तकनीशियन मेनू

source: Temperature Monitoring
hi: तापमान निगरानी

# monitorRoomTemp
source: Monitor room temperatures
hi: कमरे के तापमान की निगरानी करें

source: Cold Storages
hi: कोल्ड स्टोरेज

source: Add Cold Storage
hi: कोल्ड स्टोरेज जोड़ें

source: Cold Storage Name
hi: कोल्ड स्टोरेज का नाम

source: Cold Storage Code
hi: कोल्ड स्टोरेज कोड

source: Location
hi: स्थान

source: Total Capacity
hi: कुल क्षमता

source: Available Capacity
hi: उपलब्ध क्षमता

source: Temperature
hi: तापमान

source: Status
hi: स्थिति

source: Active
hi: सक्रिय

source: Inactive
hi: निष्क्रिय

source: Staff Management
hi: कर्मचारी प्रबंधन

source: Add Staff Member
hi: कर्मचारी जोड़ें

source: Name
hi: नाम

source: Role
hi: भूमिका

source: Assign Storages
hi: स्टोरेज आवंटित करें

source: Assign Rooms
hi: कमरे आवंटित करें

source: Inward/Outward Operator
hi: आवक/जावक संचालक

# technicianTemp
source: Technician (Temperature)
hi: तकनीशियन (तापमान)

source: Room Management
hi: कमरा प्रबंधन

source: Add Room
hi: कमरा जोड़ें

source: Room Name
hi: कमरे का नाम

source: Room Number
hi: कमरा नंबर

source: Capacity
hi: क्षमता

source: Current Occupancy
hi: वर्तमान अधिभोग

source: Temperature Alerts
hi: तापमान अलर्ट

source: Critical
hi: गंभीर

source: Warning
hi: चेतावनी

source: Normal
hi: सामान्य

source: Resolve Alert
hi: अलर्ट समाधान करें

source: Product Name
hi: उत्पाद का नाम

source: Quantity
hi: मात्रा

source: Unit
hi: इकाई

source: Customer Name
hi: ग्राहक का नाम

source: Entry Date
hi: प्रवेश तिथि

source: Exit Date
hi: निकास तिथि

source: Save
hi: सहेजें

source: Cancel
hi: रद्द करें

source: Delete
hi: हटाएं

source: Edit
hi: संपादित करें

source: Add
hi: जोड़ें

source: Update
hi: अपडेट करें

source: Search
hi: खोजें

source: Filter
hi: फ़िल्टर

source: Refresh
hi: ताज़ा करें

source: Close
hi: बंद करें

source: Required
hi: आवश्यक

source: Error
hi: त्रुटि

source: Success
hi: सफलता

source: Loading...
hi: लोड हो रहा है...

source: No data available
hi: कोई डेटा उपलब्ध नहीं

# confirmDelete
source: Are you sure you want to delete?
hi: क्या आप वाकई हटाना चाहते हैं?

source: kg
hi: किग्रा

source: tons
hi: टन

source: liters
hi: लीटर

source: units
hi: इकाइयाँ

source: Days
hi: दिन

source: Select Language
hi: भाषा चुनें

source: API base URL
hi: API बेस URL

# apiBaseUrlExample
source: Example: http://127.0.0.1:8000
hi: उदाहरण: http://127.0.0.1:8000

source: Save API URL
hi: API URL सहेजें

source: Base URL saved
hi: बेस URL सहेजा गया

source: Manage users
hi: उपयोगकर्ता प्रबंधित करें

# partyFarmerSelection
source: 1. Party / Farmer Selection
hi: 1. पार्टी / किसान चयन

source: Search Party
hi: पार्टी खोजें

source: Search by name or phone
hi: नाम या फ़ोन से खोजें

source: View all parties
hi: सभी पार्टियां देखें

source: Select Party
hi: पार्टी चुनें

source: No parties found
hi: कोई पार्टी नहीं मिली

source: Register New Party
hi: नई पार्टी पंजीकृत करें

# partyRegisteredSuccess
source: Party "{name}" registered successfully!
hi: पार्टी "{name}" सफलतापूर्वक पंजीकृत!

# cropDetails
source: 2. Crop Details
hi: 2. फसल विवरण

source: Crop Type
hi: फसल का प्रकार

source: Enter crop name
hi: फसल का नाम दर्ज करें

source: Quality Grade (Optional)
hi: गुणवत्ता ग्रेड (वैकल्पिक)

source: Grade A
hi: ग्रेड A

source: Grade B
hi: ग्रेड B

source: Grade C
hi: ग्रेड C

source: Size (Optional)
hi: आकार (वैकल्पिक)

# sizeHint
source: e.g. Small, Medium, Large, 45mm
hi: जैसे छोटा, मध्यम, बड़ा, 45mm

# quantityDetails
source: 3. Quantity Details
hi: 3. मात्रा विवरण

# enterQuantityIn
source: Enter quantity in {unit}
hi: {unit} में मात्रा दर्ज करें

# visualRecord
source: 4. Visual Record
hi: 4. दृश्य रिकॉर्ड

source: Upload Image of Goods
hi: माल की छवि अपलोड करें

source: Tap to capture or upload
hi: कैप्चर या अपलोड करने के लिए टैप करें

source: Take Photo
hi: फोटो लें

source: Choose from Gallery
hi: गैलरी से चुनें

source: Error picking image
hi: छवि चुनने में त्रुटि

# storageDetails
source: 5. Storage Details
hi: 5. स्टोरेज विवरण

source: Storage Facility
hi: स्टोरेज सुविधा

source: Storage Room
hi: स्टोरेज कमरा

source: Select storage room
hi: स्टोरेज कमरा चुनें

# noStorageRoomsAvailable
source: No storage rooms available for your assigned facility. Please contact manager.
hi: आपकी आवंटित सुविधा के लिए कोई स्टोरेज कमरा उपलब्ध नहीं है। कृपया प्रबंधक से संपर्क करें।

source: Storage Duration
hi: स्टोरेज अवधि

# sixtyDays
source: 60 Days
hi: 60 दिन

# ninetyDays
source: 90 Days
hi: 90 दिन

# oneYear
source: 1 Year
hi: 1 वर्ष

source: Enter days
hi: दिन दर्ज करें

source: Save Inward Entry
hi: आवक प्रविष्टि सहेजें

source: Entry Saved
hi: प्रविष्टि सहेजी गई

# inwardEntrySuccess
source: Inward entry has been successfully recorded.
hi: आवक प्रविष्टि सफलतापूर्वक दर्ज की गई।

source: Download Receipt
hi: रसीद डाउनलोड करें

# pleaseSelectParty
source: Please select a party/farmer
hi: कृपया एक पार्टी/किसान चुनें

# pleaseSelectStorageRoom
source: Please select a storage room
hi: कृपया एक स्टोरेज कमरा चुनें

# noStorageAssigned
source: Error: No Storage assigned to this operator.
hi: त्रुटि: इस ऑपरेटर को कोई स्टोरेज आवंटित नहीं है।

# selectBookingParty
source: 1. Select Booking / Party
hi: 1. बुकिंग / पार्टी चुनें

source: Search Stored Inventory
hi: संग्रहित इन्वेंटरी खोजें

# searchByPartyPhoneCrop
source: Search by party, phone, or crop
hi: पार्टी, फ़ोन या फसल से खोजें

source: No inventory found
hi: कोई इन्वेंटरी नहीं मिली

source: Available Inventory
hi: उपलब्ध इन्वेंटरी

# itemsCount
source: {count} items
hi: {count} आइटम

source: Party
hi: पार्टी

source: Available
hi: उपलब्ध

source: Quantity to remove
hi: निकालने की मात्रा

source: Enter quantity
hi: मात्रा दर्ज करें

source: Confirm Outward
hi: जावक की पुष्टि करें

source: Outward Recorded
hi: जावक दर्ज

# outwardReceiptGenerated
source: Outward receipt #{number} generated.
hi: जावक रसीद #{number} बनाई गई।

# pleaseEnterValidQuantity
source: Please enter a valid quantity
hi: कृपया एक वैध मात्रा दर्ज करें

# quantityExceedsStock
source: Quantity exceeds available stock ({available})
hi: मात्रा उपलब्ध स्टॉक ({available}) से अधिक है

source: Processing outward entry...
hi: जावक प्रविष्टि प्रोसेस हो रही है...

source: Error loading inventory
hi: इन्वेंटरी लोड करने में त्रुटि

# quickRegistration
source: Quick registration - takes less than 30 seconds
hi: त्वरित पंजीकरण - 30 सेकंड से कम समय लगता है

source: Enter full name
hi: पूरा नाम दर्ज करें

source: Party Type
hi: पार्टी का प्रकार

source: Farmer
hi: किसान

# traderCompany
source: Trader / Co.
hi: व्यापारी / कंपनी

source: Transporter
hi: ट्रांसपोर्टर

source: Cold Storage
hi: कोल्ड स्टोरेज

# pleaseSelectColdStorage
source: Please select a cold storage
hi: कृपया कोल्ड स्टोरेज चुनें

source: Storage
hi: स्टोरेज

source: Village / City
hi: गांव / शहर

# enterVillageOrCity
source: Enter village or city name
hi: गांव या शहर का नाम दर्ज करें

source: GST Number (Optional)
hi: GST नंबर (वैकल्पिक)

source: Notes (Optional)
hi: नोट्स (वैकल्पिक)

# addNotes
source: Add any additional notes...
hi: अतिरिक्त नोट्स जोड़ें...

source: Save Party
hi: पार्टी सहेजें

source: Owner Overview
hi: मालिक अवलोकन

# highLevelMetrics
source: High-level business metrics
hi: उच्च स्तरीय व्यापार मेट्रिक्स

source: Overview
hi: अवलोकन

source: Storages
hi: स्टोरेज

source: No storages
hi: कोई स्टोरेज नहीं

source: Select Storage
hi: स्टोरेज चुनें

source: Storage Utilization
hi: स्टोरेज उपयोग

source: of capacity
hi: क्षमता का

# mtOccupied
source: {value} MT occupied
hi: {value} MT भरा हुआ

# mtTotal
source: {value} MT total
hi: {value} MT कुल

source: This Month
hi: इस महीने

source: Inflow
hi: आवक

source: MT received
hi: MT प्राप्त

source: Outflow
hi: जावक

source: MT dispatched
hi: MT भेजा गया

source: Active Bookings
hi: सक्रिय बुकिंग

source: Confirmed
hi: पुष्टि

source: Pending
hi: लंबित

source: Alert Summary
hi: अलर्ट सारांश

# roomsOutOfRange
source: {count} rooms out of range
hi: {count} कमरे सीमा से बाहर

source: All rooms normal
hi: सभी कमरे सामान्य

source: Equipment Status
hi: उपकरण स्थिति

source: All systems operational
hi: सभी सिस्टम चालू

source: Revenue (Est.)
hi: राजस्व (अनुमानित)

source: Avg. Duration
hi: औसत अवधि

source: Manage managers & staff
hi: प्रबंधक और कर्मचारी प्रबंधित करें

source: Add New Staff Member
hi: नया कर्मचारी जोड़ें

# phoneNumberRequired
source: Phone Number *
hi: फ़ोन नंबर *

# nameRequired
source: Name *
hi: नाम *

source: Enter name
hi: नाम दर्ज करें

# roleRequired
source: Role *
hi: भूमिका *

# fullAccessDescription
source: Full access to manage storages, staff & inventory
hi: स्टोरेज, कर्मचारी और इन्वेंटरी प्रबंधित करने की पूर्ण पहुंच

# inwardOutwardOnly
source: Inward/Outward operations only
hi: केवल आवक/जावक संचालन

# tempMonitoringAlerts
source: Temperature monitoring & alerts
hi: तापमान निगरानी और अलर्ट

# phoneNameRequired
source: Phone number and name are required
hi: फ़ोन नंबर और नाम आवश्यक हैं

# staffAddedSuccess
source: Staff member added successfully
hi: कर्मचारी सफलतापूर्वक जोड़ा गया

source: Add Staff
hi: कर्मचारी जोड़ें

source: Edit Staff Member
hi: कर्मचारी संपादित करें

# phoneLabel
source: Phone: {phone}
hi: फ़ोन: {phone}

source: Full access
hi: पूर्ण पहुंच

source: Inward/Outward
hi: आवक/जावक

source: Save Changes
hi: बदलाव सहेजें

# staffUpdatedSuccess
source: Staff updated successfully
hi: कर्मचारी सफलतापूर्वक अपडेट किया गया

source: Managers
hi: प्रबंधक

# canManageOperations
source: Can manage storage operations
hi: स्टोरेज संचालन प्रबंधित कर सकते हैं

source: Operators
hi: ऑपरेटर

# inwardOutwardOps
source: Inward/Outward operations
hi: आवक/जावक संचालन

source: Technicians
hi: तकनीशियन

# tempMonitoring
source: Temperature monitoring
hi: तापमान निगरानी

source: No {role} added yet
hi: अभी तक कोई {role} नहीं जोड़ा

source: Disabled
hi: अक्षम

source: Enable
hi: सक्षम करें

source: Disable
hi: अक्षम करें

source: Delete Staff?
hi: कर्मचारी हटाएं?

# deleteStaffConfirm
source: Are you sure you want to delete {name}? This action cannot be undone.
hi: क्या आप वाकई {name} को हटाना चाहते हैं? यह कार्रवाई पूर्ववत नहीं की जा सकती।

# staffDeletedSuccess
source: Staff member deleted successfully
hi: कर्मचारी सफलतापूर्वक हटाया गया

source: Error loading staff
hi: कर्मचारी लोड करने में त्रुटि

source: Error loading storages
hi: स्टोरेज लोड करने में त्रुटि

source: Manage your facilities
hi: अपनी सुविधाएं प्रबंधित करें

source: Add New Storage
hi: नया स्टोरेज जोड़ें

source: Add Storage
hi: स्टोरेज जोड़ें

source: Edit Storage
hi: स्टोरेज संपादित करें

source: Storage Type
hi: स्टोरेज प्रकार

source: Silos
hi: साइलो

source: Warehouses
hi: गोदाम

source: Frozen Storages
hi: फ्रोजन स्टोरेज

source: Ripening Chambers
hi: पकाने के कमरे

# controlledAtmosphere
source: Controlled Atmosphere Storage
hi: नियंत्रित वातावरण स्टोरेज

# storageNameHint
source: e.g. Storage Main
hi: जैसे स्टोरेज मुख्य

# codeRequired
source: Code *
hi: कोड *

# codeHint
source: e.g. STR1
hi: जैसे STR1

source: City
hi: शहर

# cityHint
source: e.g. Nashik
hi: जैसे नासिक

source: Total Capacity (MT)
hi: कुल क्षमता (MT)

# roomsRequired
source: Rooms *
hi: कमरे *

# addAtLeastOneRoom
source: Add at least one room for this storage
hi: इस स्टोरेज के लिए कम से कम एक कमरा जोड़ें

# roomsHint
source: e.g. Room A, Room B, Room C (comma separated)
hi: जैसे कमरा A, कमरा B, कमरा C (कॉमा से अलग)

# separateWithCommas
source: Separate multiple rooms with commas
hi: कई कमरों को कॉमा से अलग करें

# nameCodeRequired
source: Name and Code are required
hi: नाम और कोड आवश्यक हैं

source: Storage deleted
hi: स्टोरेज हटाया गया

# atLeastOneRoomRequired
source: At least one room is required
hi: कम से कम एक कमरा आवश्यक है

# storageCreatedSuccess
source: Storage created successfully
hi: स्टोरेज सफलतापूर्वक बनाया गया

# storageUpdatedSuccess
source: Storage updated successfully
hi: स्टोरेज सफलतापूर्वक अपडेट किया गया

source: Create
hi: बनाएं

source: Your Storages ({count})
hi: आपके स्टोरेज ({count})

source: No storages yet
hi: अभी कोई स्टोरेज नहीं

# addFirstStorage
source: Add your first storage facility
hi: अपनी पहली स्टोरेज सुविधा जोड़ें

source: Capacity Usage
hi: क्षमता उपयोग

# mtUsed
source: {value} MT used
hi: {value} MT उपयोग

# managerLabel
source: Manager:
hi: प्रबंधक:

source: Change
hi: बदलें

source: Assign
hi: आवंटित करें

source: View
hi: देखें

source: Assign Manager
hi: प्रबंधक आवंटित करें

# coldStorageLabel
source: Cold Storage: {name}
hi: कोल्ड स्टोरेज: {name}

source: Select Manager:
hi: प्रबंधक चुनें:

source: No Manager
hi: कोई प्रबंधक नहीं

# managerAssignedSuccess
source: Manager assigned successfully
hi: प्रबंधक सफलतापूर्वक आवंटित किया गया

source: Code
hi: कोड

source: Occupied
hi: भरा हुआ

source: Error loading cold storages
hi: कोल्ड स्टोरेज लोड करने में त्रुटि

# temperatureAlertsSummary
source: Temperature Alerts
hi: तापमान अलर्ट

source: All rooms operational
hi: सभी कमरे चालू

source: rooms need attention
hi: कमरों को ध्यान देने की जरूरत है

source: Manager Dashboard
hi: प्रबंधक डैशबोर्ड

# welcome
source: Welcome, {name}
hi: स्वागत है, {name}

# storageLabel
source: Storage: {names}
hi: स्टोरेज: {names}

# noStorageAssignedTitle
source: No Storage Assigned
hi: कोई स्टोरेज आवंटित नहीं

# contactOwnerMessage
source: Please contact the owner to assign you a storage.
hi: कृपया स्टोरेज आवंटित करने के लिए मालिक से संपर्क करें।

# activeEntriesCount
source: {count} active entries
hi: {count} सक्रिय प्रविष्टियाँ

source: Inventory Summary
hi: इन्वेंटरी सारांश

source: View stored crops
hi: संग्रहीत फसलें देखें

# alertsActiveCount
source: {count} alerts active
hi: {count} अलर्ट सक्रिय

# teamMembersCount
source: {count} team members
hi: {count} टीम सदस्य

source: Pending Requests
hi: लंबित अनुरोध

source: Awaiting approval
hi: अनुमोदन की प्रतीक्षा में

source: Total Stock
hi: कुल स्टॉक

# acrossCropTypes
source: Across {count} crop types
hi: {count} फसल प्रकारों में

source: Add Inward
hi: इनवर्ड जोड़ें

source: Mark Outward
hi: आउटवर्ड मार्क करें

source: Unknown
hi: अज्ञात

source: In storage
hi: स्टोरेज में

source: Inward Date
hi: इनवर्ड तिथि

source: Expected Out
hi: अपेक्षित आउट

# addAndManageStaff
source: Add and manage storage staff
hi: स्टोरेज स्टाफ जोड़ें और प्रबंधित करें

source: Delete Staff Member
hi: स्टाफ सदस्य हटाएं

# deleteStaffMemberConfirm
source: Are you sure you want to delete this staff member?
hi: क्या आप वाकई इस स्टाफ सदस्य को हटाना चाहते हैं?

# errorMessage
source: Error: {error}
hi: त्रुटि: {error}

# staffMemberAddedSuccess
source: Staff member added successfully
hi: स्टाफ सदस्य सफलतापूर्वक जोड़ा गया

# editStaff
source: Edit Staff Member
hi: स्टाफ सदस्य संपादित करें

# staffMemberUpdatedSuccess
source: Staff member updated successfully
hi: स्टाफ सदस्य सफलतापूर्वक अपडेट किया गया

source: Staff Members ({count})
hi: स्टाफ सदस्य ({count})

source: No Role
hi: कोई भूमिका नहीं

# activeAlertsCount
source: {count} active alerts
hi: {count} सक्रिय अलर्ट

source: Active Alerts
hi: सक्रिय अलर्ट

source: All Clear!
hi: सब ठीक है!

# noActiveAlerts
source: No active temperature alerts
hi: कोई सक्रिय तापमान अलर्ट नहीं

source: Normal Status
hi: सामान्य स्थिति

source: Unknown Room
hi: अज्ञात कमरा

source: Current Temp
hi: वर्तमान तापमान

source: Allowed Range
hi: अनुमत रेंज

# tempRange
source: {min}°C to {max}°C
hi: {min}°C से {max}°C

source: Take Action
hi: कार्रवाई करें

# actionTaken
source: Action - {roomName}
hi: कार्रवाई - {roomName}

source: Acknowledge
hi: स्वीकार करें

source: Mark as seen
hi: देखा गया मार्क करें

source: Resolve
hi: समाधान करें

# issueFixed
source: Issue has been fixed
hi: समस्या ठीक हो गई है

# alertActionSuccess
source: Alert {action}d successfully
hi: अलर्ट {action} सफलतापूर्वक

source: Within range
hi: रेंज के भीतर

# errorLoadingAlerts
source: Error loading alerts: {error}
hi: अलर्ट लोड करने में त्रुटि: {error}

source: Room Temperature Settings
hi: कमरे की तापमान सेटिंग्स

# roomsCount
source: {count} rooms
hi: {count} कमरे

source: No rooms found
hi: कोई कमरा नहीं मिला

source: Add New Room
hi: नया कमरा जोड़ें

# coldStorageRequired
source: Cold Storage *
hi: कोल्ड स्टोरेज *

# roomNameRequired
source: Room Name *
hi: कमरे का नाम *

# roomNameHint
source: e.g. Room A
hi: जैसे कमरा A

source: Capacity (MT)
hi: क्षमता (MT)

# minTemperature
source: Min Temperature (°C)
hi: न्यूनतम तापमान (°C)

# maxTemperature
source: Max Temperature (°C)
hi: अधिकतम तापमान (°C)

# roomNameStorageRequired
source: Room name and storage are required
hi: कमरे का नाम और स्टोरेज आवश्यक है

# roomAddedSuccess
source: Room added successfully
hi: कमरा सफलतापूर्वक जोड़ा गया

source: Set Temperature Range
hi: तापमान रेंज सेट करें

# minimumTemperature
source: Minimum Temperature (°C)
hi: न्यूनतम तापमान (°C)

# minTempExample
source: e.g., -5
hi: जैसे, -5

# maximumTemperature
source: Maximum Temperature (°C)
hi: अधिकतम तापमान (°C)

# maxTempExample
source: e.g., 0
hi: जैसे, 0

# temperatureAlertInfo
source: Alerts will be created when temperature goes outside this range
hi: जब तापमान इस रेंज से बाहर जाता है तो अलर्ट बनाया जाएगा

# minLessThanMax
source: Minimum must be less than maximum
hi: न्यूनतम अधिकतम से कम होना चाहिए

# temperatureRangeUpdated
source: Temperature range updated successfully
hi: तापमान रेंज सफलतापूर्वक अपडेट की गई

source: Edit Temperature Range
hi: तापमान रेंज संपादित करें

# noStoragesAssigned
source: No storages assigned to you
hi: आपको कोई स्टोरेज आवंटित नहीं किया गया

source: Booking Requests
hi: बुकिंग अनुरोध

source: Manage storage requests
hi: स्टोरेज अनुरोध प्रबंधित करें

source: Under Development
hi: विकास में

# featureComingSoon
source: This feature is coming soon!\nBooking requests and approvals will be available here.
hi: यह सुविधा जल्द ही आ रही है!\nबुकिंग अनुरोध और अनुमोदन यहां उपलब्ध होंगे।

# versionFeature
source: Version 2.0 Feature
hi: संस्करण 2.0 सुविधा

# errorLoadingRooms
source: Error loading rooms: {error}
hi: कमरे लोड करने में त्रुटि: {error}

# pleaseSelectRoom
source: Please select a room
hi: कृपया एक कमरा चुनें

source: Please enter temperature
hi: कृपया तापमान दर्ज करें

# tempLoggedSuccess
source: ✓ Temperature logged successfully - Within range
hi: ✓ तापमान सफलतापूर्वक लॉग किया गया - रेंज के भीतर

# tempLoggedWarning
source: ⚠ Temperature logged - Warning: Out of range
hi: ⚠ तापमान लॉग किया गया - चेतावनी: रेंज से बाहर

# tempLoggedCritical
source: ⚠ Temperature logged - CRITICAL: Alert created
hi: ⚠ तापमान लॉग किया गया - गंभीर: अलर्ट बनाया गया

# errorLoggingTemp
source: Error logging temperature: {error}
hi: तापमान लॉग करने में त्रुटि: {error}

source: No storage rooms assigned
hi: कोई स्टोरेज कमरा आवंटित नहीं

# contactManager
source: Please contact your manager
hi: कृपया अपने प्रबंधक से संपर्क करें

# selectRoomInstruction
source: Select a room and enter the current temperature reading
hi: एक कमरा चुनें और वर्तमान तापमान रीडिंग दर्ज करें

# selectStorageRoomRequired
source: Select Storage Room *
hi: स्टोरेज कमरा चुनें *

# chooseRoom
source: Choose a room
hi: एक कमरा चुनें

# temperatureCelsius
source: Temperature (°C) *
hi: तापमान (°C) *

# enterTempHint
source: Enter temperature (e.g., -2.5)
hi: तापमान दर्ज करें (जैसे, -2.5)

source: Log Temperature
hi: तापमान लॉग करें

source: Assigned Rooms
hi: आवंटित कमरे
